### Plan for `COMPARE/prod`
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # newrelic_entity_tags.synthetic_tags["COMPARE_CLOUD_TAG1"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "dev",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "COMPARE_CLOUD",
            ]
        }
      + tag {
          + key    = "service_name"
          + values = [
              + "Comparison_Service_API",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["COMPARE_CLOUD_TAG14"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "qa",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "COMPARE_CLOUD",
            ]
        }
      + tag {
          + key    = "service_name"
          + values = [
              + "Conversion_Service_API",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["COMPARE_CLOUD_TAG15"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "qa",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "COMPARE_CLOUD",
            ]
        }
      + tag {
          + key    = "service_name"
          + values = [
              + "RetentionManager_Service_API",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["COMPARE_CLOUD_TAG2"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "dev",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "COMPARE_CLOUD",
            ]
        }
      + tag {
          + key    = "service_name"
          + values = [
              + "Storage_Service_API",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["COMPARE_CLOUD_TAG3"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "dev",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "COMPARE_CLOUD",
            ]
        }
      + tag {
          + key    = "service_name"
          + values = [
              + "Configuration_Service_API",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["COMPARE_CLOUD_TAG4"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "dev",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "COMPARE_CLOUD",
            ]
        }
      + tag {
          + key    = "service_name"
          + values = [
              + "Compare_AI",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["COMPARE_CLOUD_TAG5"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "dev",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "COMPARE_CLOUD",
            ]
        }
      + tag {
          + key    = "service_name"
          + values = [
              + "Compare_web",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_synthetics_monitor.synthetic_monitor["COMPARE_CLOUD_PING1"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "COMPARE CLOUD - PING test for Comparison Service API health check for DEV"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://dev.platform.lmscloudlab.com/api/compare/comparison/status/healthcheck/"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["COMPARE_CLOUD_PING14"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "COMPARE CLOUD - PING test for Conversion Service API health check for QA"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://qa.platform.lmscloudlab.com/api/compare/conversion/status/healthcheck/"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["COMPARE_CLOUD_PING15"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "COMPARE CLOUD - PING test for RetentionManager Service API health check for QA"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://qa.platform.lmscloudlab.com/api/compare/retention-manager/status/healthcheck/"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["COMPARE_CLOUD_PING2"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "COMPARE CLOUD - PING test for Storage Service API health check for DEV"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://dev.platform.lmscloudlab.com/api/compare/storage/status/healthcheck"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["COMPARE_CLOUD_PING3"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "COMPARE CLOUD - PING test for Configuration Service API health check for DEV"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://dev.platform.lmscloudlab.com/api/compare/configuration/status/healthcheck/"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["COMPARE_CLOUD_PING4"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "COMPARE CLOUD - PING test for Compare AI API health check for DEV"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://dev.platform.lmscloudlab.com/api/compare/ai/healthz"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["COMPARE_CLOUD_PING5"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "COMPARE CLOUD - PING test for Compare web API health check for DEV"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://dev.platform.lmscloudlab.com/app/compare/web/healthz.html"
      + verify_ssl        = true
    }

Plan: 14 to add, 0 to change, 0 to destroy.

```

